Repository: Metatavu/noheva-exhibition-ui
Catalog: lib/l10n/app_*.arb
Languages: fi

# deviceSetupTitle
source: Device setup
fi: Laitteen käyttöönotto

# deviceSetupNameLabel
source: Name of device
fi: Laitteen nimi

# deviceSetupDescriptionLabel
source: Description of device
fi: Laitteen kuvaus

# deviceSetupInfoText
source: Enter name and description of the device and press submit to initiate device setup. Optionally you can skip this step and configure devices name and description within the Noheva management.
fi: Syötä laitteen nimi ja kuvaus ja paina lähetä aloittaaksesi laitteen käyttöönoton. Voit myös ohittaa tämän vaiheen ja määrittää laitteen nimen ja kuvauksen Noheva-hallinnassa.

# deviceSetupSubmitButton
source: Proceed
fi: Jatka

# deviceSetupSkipButton
source: Skip setup
fi: Ohita

# deviceNotYetApproved
source: Device has not yet been approved.
fi: Laitetta ei ole vielä otettu käyttöön.

# deviceIsApproved
source: Device is approved and ready to use.
fi: Laite on otettu käyttöön.

# currentVersion
source: Current version: {currentVersion}
fi: Nykyinen versio: {currentVersion}

# availableVersion
source: Available version: {availableVersion}
fi: Saatavilla oleva versio: {availableVersion}

# installUpdateButton
source: Install update
fi: Asenna päivitys

# mqttClientConnectionStatus
source: MQTT client connection status: {status}
fi: MQTT-yhteyden tila: {status}

source: Skip
fi: Ohita

source: Loading...
fi: Ladataan...
